Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/registration_of_marriage.html.txt.tmx
Source language: en
Languages: ga

source: Since the commencement of Part 6 of the Civil Registration Act 2004 in November 2007, the registration procedure for marriage is the same whether you are marrying in a Registry Office or by religious or secular ceremony
ga: Ón Samhain 2007 i leith, tar éis theacht i bhfeidhm Cuid 6 den Acht um Chlárú Sibhialta 2004, is é an nós imeachta clárúcháin céanna atá i gceist do phósadh más ag pósadh in Oifig Chláraithe nó trí shearmanas reiligiúnach nó saolta atá lánúin

source: If you are getting married by civil ceremony in a Registry Office or other approved place, you should approach the Registrar of Civil Marriages for the district in which you intend to marry for information on how to proceed
ga: Má tá tú ag pósadh trí shearmanas sibhialta in Oifig Chláraithe nó áit cheadaithe eile, ba chóir duit teagmháil a dhéanamh le Cláraitheoir na bPóstaí Sibhialta don dúiche ina bhfuil sé beartaithe agat pósadh, chun faisnéis a fháil maidir leis an gceist a bhogadh ar aghaidh

source: If you are getting married by religious or secular ceremony, you should approach the authorities of the body concerned for advice on how to proceed
ga: Má tá tú ag pósadh trí shearmanas saolta nó reiligiúnach, ba chóir duit teagmháil a dhéanamh le húdaráis an comhlachtlena mbaineann, chun comhairle a fháil maidir leis an gceist a bhogadh ar aghaidh

source: Since November 2007, a couple getting married are required to give notification in person of their intention to marry to a Registrar at least 3 months before the intended date of their marriage
ga: Ó Shamhain 2007 i leith, tá ar lánúin a bheidh ag pósadh fógra i bpearsan a thabhairt go bhfuil sé beartaithe acu pósadh do Chláraitheoir ar a laghad 3 mhí roimh dháta beartaithe a bpósta

source: A couple in a civil partnership who wish to marry should contact the Registrar who will guide them through the process
ga: Ba cheart do lánúin atá i bpáirtnéireacht shibhialta ar mian leo pósadh teagmháil a dhéanamh leis an gCláraitheoir a threoróidh tríd an bpróiseas iad

source: The notification can be given to any Registrar
ga: Is féidir an fógra a thabhairt d’aon Chláraitheoir

source: If there is no impediment to your marriage, the Registrar will issue you with a Marriage Registration Form (MRF) which gives you permission to marry
ga: Mura bhfuil aon bhac ar do phósadh, eiseoidh an Cláraitheoir Foirm Chláraithe Pósta (FCP) duit a thugann cead duit pósadh

source: Read more about notification requirements here
ga: Léigh tuilleadh faoi riachtanais fógartha anseo

source: You should give the MRF to whomever will be solemnising your marriage before the marriage ceremony
ga: Ba chóir duit an FCP a thabhairt do cibé a bheidh ag sollúnú bhur bpósadh, roimh shearmanas an phósta

source: Immediately after the marriage ceremony the MRF should be signed by you and your spouse, the two witnesses and the person solemnising the marriage
ga: Díreach tar éis an tsearmanais phósta, caithfidh FCP a beith sínithe agat féin, ag do chéile, ag an mbeirt fhinnéithe agus ag an té atá ag sollúnú an phósta

source: If you get married by civil ceremony, the Registrar who solemnised the marriage will register the marriage with the information on the MRF as soon as possible after the ceremony
ga: Má phósann sibh trí shearmanas sibhialta, déanfaidh an Cláraitheoir a rinne sollúnú ar an bpósadh an pósadh a chlárú leis an eolas ar an FCP chomh luath agus is féidir tar éis an tsearmanais

source: If you get married by religious or secular ceremony, you should give the MRF within one month to a Registrar, for the marriage to be registered
ga: Má phósann sibh trí shearmanas reiligiúnach nó saolta, ba chóir an FCP a thabhairt do Chláraitheoir taobh istigh de mhí amháin, chun go gclárófar an pósadh

source: It does not have to be returned to the Registrar who issued it
ga: Ní gá é a sheoladh ar ais chuig an gCláraitheoir a d'eisigh é

source: Under Section 50 of the Civil Registration Act 2004, if the completed MRF is not returned to a Registrar within 56 days of the intended date of marriage recorded on the MRF, the Registrar can serve a notice on you requiring you to return the MRF within 14 days of receiving the notice
ga: Faoi Alt 50 den Acht um Chlárú Sibhialta 2004, mura seoltar an FCP comhlánaithe ar ais chuig Cláraitheoir taobh istigh de 56 lá den dáta pósta beartaithe a taifeadadh ar an FCP, is féidir leis an gCláraitheoir fógra a sheirbheáil ort ag éileamh ort an FCP a sheoladh ar ais taobh istigh de 14 lá tar éis duit an fógra a fháil

source: If you do not comply with this requirement, the Registrar can serve a notice on you requiring you to attend on a particular date at the office of the Registrar (or other place given in the notice) with the completed MRF
ga: Mura gcloíonn tú leis an riachtanas seo, is féidir leis an gCláraitheoir fógra a sheirbheáil ort ag éileamh ort a bheith i láthair ar dháta ar leith ag oifig an Chláraitheora (nó in áit eile a thugtar sa bhfógra) leis an FCP comhlánaithe

source: If you are unable to give the MRF to the Registrar when you meet, you have a further 14 days to give it
ga: Mura féidir leat an FCP a thabhairt don Chláraitheoir nuair a bhuaileann sibh le chéile, tá 14 lá breise agat chun é a thabhairt

source: You cannot get your marriage certificate until the marriage is registered
ga: Ní féidir leat do theastas pósta a fháil go dtí go gcláraítear an pósadh

source: Registration of marriages outside Ireland
ga: Clárú póstaí taobh amuigh d'Éirinn

source: Marriages of Irish citizens abroad are normally registered in the country where they occur
ga: De ghnáth tá póstaí shaoránaigh Éireannacha thar lear cláraithe sa tír ina dtarlaíonn siad

source: The General Register Office (central civil repository for records relating to births, deaths and marriages in Ireland) has no function in the registration of marriages of Irish citizen(s) that take place abroad, or in advising on such marriages
ga: Níl feidhm ar bith ag Oifig an Ard-Chláraitheora (taisclann sibhialta lárnach do thaifid maidir le breitheanna, básanna agus póstaí in Éirinn) i gclárú póstaí saoránach Éireannach a tharlaíonn thar lear, ná comhairle a thabhairt maidir póstaí den sórt sin

source: Marriages that take place outside the State are not registered in Ireland
ga: Ní chláraítear póstaí a tharlaíonn lasmuigh den stát in Éirinn

source: Your foreign marriage certificate will usually be accepted for official purposes in Ireland where you need to show evidence that you are married
ga: Is iondúil go nglacfar le do theastas pósta eachtrannach maidir le cuspóirí oifigiúla in Éirinn, nuair is gá duit fianaise a léiriú go bhfuil tú pósta

source: If the certificate is in a foreign language, you must provide an official translation or a translation from a recognised translation agency
ga: Má tá an teastas i dteanga eachtrannach, ní mór duit aistriúchán oifigiúil a chur ar fáil, nó aistriúchán ó ghníomhaireacht aistriúcháin aitheanta

source: There is no fee charged for the registration of a marriage, or for the correction of errors on a marriage certificate
ga: Níl aon táille a ghearrtar chun pósadh a chlárú, nó chun earráidí ar theastas pósta a cheartú

source: Fees are charged for copies of certificates
ga: Gearrtar táillí ar chóipeanna deimhnithe

source: A certificate is issued for social welfare purposes at a reduced cost
ga: Tá deimhniú arna eisiúint chun críocha leasa shóisialaigh ar chostas laghdaithe

source: Evidence it is for social welfare purposes is required, such as a letter from the Department of Social Protection
ga: Fianaise go bhfuil sé chun críocha leasa shóisialaigh ag teastáil, mar shampla litir ón Roinn Coimirce Sóisialaí

source: The fees charged for a certificate are as follows:
ga: Is iad na táillí a ghearrtar ar theastas ná:

source: • €1 for a copy for social welfare purposes (letter from Department of Social Protection required)
ga: • €1 do chóip chun críocha leasa shóisialaigh (litir ón Roinn Coimirce Sóisialaí ag teastáil)

source: • €4 for an uncertified copy of an entry in the Register
ga: • €4 do chóip neamhdheimhnithe d’iontráil isteach sa Clár

source: • €10 to have a certificate authenticated (only available from the General Register Office)
ga: • €10 go bhfuil deimhniú fíordheimhnithe (ar fáil ón Oifig Chlár Ghinearálta amháin)

source: To obtain a copy of your marriage certificate you should contact any Registrar of Births, Marriages and Deaths, specifying the exact date and place of the marriage and the names of the bride and groom
ga: Chun cóip a fháil de do theastas pósta, ba chóir duit dul i dteagmháil le Cláraitheoir do Bhreitheanna, Póstaí agus Básanna, ag tabhairt an dáta díreach agus an áit ar tharla an pósadh chomh maith le hainmneacha na beirte a phós

source: An application form for a copy of a marriage certificate is available here
ga: Tá foirm iarratais i gcomhair cóip de theastas pósta ar fáil anseo

source: You can also apply online for a copy of a certificate
ga: Is féidir leat cur isteach ar-líne ar chóipeanna de theastais

source: If you got married in Ireland (whether by civil, secular or religious ceremony) you can get a copy of your Marriage Certificate from any Registrar of Births, Marriages and Deaths
ga: Má phós tú in Éirinn (cibé an searmanas sibhialta, saolta nó reiligiúnach a bhí ann) is féidir leat cóip de do Theastas Pósta a fháil ó Cláraitheoir do Bhreitheanna, Póstaí agus Básanna
